# Link to Dataset

Ireland

https://data.gov.ie/dataset/toa11-luas-passenger-numbers

Turkey 

API

https://data.ibb.gov.tr/tr/datastore/odata3.0/5c2b78fc-3b68-4722-844f-3051c358a13f
        
CSV

https://data.ibb.gov.tr/en/dataset/d3df8db4-1ac6-4bfe-8896-7ec1159caa2b/resource/8bed95de-bbe2-4550-80f2-87ca51a97f3d/download/2022-yl-ya-grubuna-gore-rayl-sistemler-istasyon-bazl-yolcu-ve-yolculuk-saylar.csv

https://data.ibb.gov.tr/en/dataset/rayli-sistemler-istasyon-bazli-yolcu-ve-yolculuk-sayilari/resource/5c2b78fc-3b68-4722-844f-3051c358a13f

In [1]:
# Import NumPy, Pandas, Matplotlib, Seaborn libraries and Plotly Express, and Sci

import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import plotly.express as px

# Import warnings and applyt filterwarnings to ignore them.

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("Luas_Passenger_Number.csv")

# pd.read_csv function in order to read the csv file containing the population estimated construction status report

In [3]:
df1=pd.read_csv("Turkey_Rail_Passenger_Number.csv", encoding = 'latin-1')

df1 = pd.read_csv("Turkey_Rail_Passenger_Number.csv")

A problem was encountered when trying to open the file. To fix the problem, it was observed that there was a problem decoding a byte in the file using the 'utf-8' encoding, so an addition to the code was made accordingly.

In [4]:
df.head(5)

,STATISTIC,Statistic Label,TLIST(A1),Year,C01885V02316,Month,UNIT,VALUE
0,TOA11C01,Red line,2018,2018,1,January,Number,1664495
1,TOA11C01,Red line,2018,2018,2,February,Number,1657562
2,TOA11C01,Red line,2018,2018,3,March,Number,1661098
3,TOA11C01,Red line,2018,2018,4,April,Number,1794424
4,TOA11C01,Red line,2018,2018,5,May,Number,1934553

In [5]:
missing_values = ['/',' ','-','--','na','Na','n/a','NA','n.a.','?','nan','Nan','nul','Nul','null','Null']

df= pd.read_csv('Luas_Passenger_Number.csv',na_values=missing_values)

# Create a list with all the possible missing value formats. Create a name for the dataframe as report
# ('PopulationEstimatesDatabase1')and apply the pd.read_csv function 
# Include the variable 'na_values' and define it with the 'missing values' list previously created

In [6]:
df.isnull().sum()

# Check missing values by applying the .isnull().sum method to the dataframe

STATISTIC           0
Statistic Label     0
TLIST(A1)           0
Year                0
C01885V02316       15
Month               0
UNIT                0
VALUE               0
dtype: int64

In [7]:
df.columns

Index(['STATISTIC', 'Statistic Label', 'TLIST(A1)', 'Year', 'C01885V02316',
       'Month', 'UNIT', 'VALUE'],
      dtype='object')

In [8]:
df.rename(columns={'Statistic Label':'Statistic_Label', 
                   'UNIT':'Unit', 'VALUE':'Value',}, inplace=True)

In [9]:
df.head(5)

,STATISTIC,Statistic_Label,TLIST(A1),Year,C01885V02316,Month,Unit,Value
0,TOA11C01,Red line,2018,2018,1.0,January,Number,1664495
1,TOA11C01,Red line,2018,2018,2.0,February,Number,1657562
2,TOA11C01,Red line,2018,2018,3.0,March,Number,1661098
3,TOA11C01,Red line,2018,2018,4.0,April,Number,1794424
4,TOA11C01,Red line,2018,2018,5.0,May,Number,1934553

In [10]:
df.drop(columns=["STATISTIC", "TLIST(A1)", "C01885V02316","Unit"], inplace=True)

In [11]:
df.head(2)

  Statistic_Label  Year     Month    Value
0        Red line  2018   January  1664495
1        Red line  2018  February  1657562

In [12]:
month_mapping = {'January': 1, 'February': 2, 'March': 3, 'April': 4, 'May': 5, 'June': 6,
                 'July': 7, 'August': 8, 'September': 9, 'October': 10, 'November': 11, 'December': 12}

df['Month'] = df['Month'].map(month_mapping)

df['Month'] = pd.to_numeric(df['Month'], errors='coerce')

df['Month'].fillna(0, inplace=True)

df['Month'] = df['Month'].astype(int)

print(df)

    Statistic_Label  Year  Month     Value
0          Red line  2018      1   1664495
1          Red line  2018      2   1657562
2          Red line  2018      3   1661098
3          Red line  2018      4   1794424
4          Red line  2018      5   1934553
..              ...   ...    ...       ...
190  All Luas lines  2022      9   3811093
191  All Luas lines  2022     10   4219124
192  All Luas lines  2022     11   4375705
193  All Luas lines  2022     12   4030698
194  All Luas lines  2022      0  38667875

[195 rows x 4 columns]

In [13]:
df.isnull().sum() / len(df) * 100

Statistic_Label    0.0
Year               0.0
Month              0.0
Value              0.0
dtype: float64

In [14]:
df_frame = pd.DataFrame(df)

df_1 = df_frame[(df_frame['Statistic_Label'] == 'All Luas lines')]

print(df_1)

    Statistic_Label  Year  Month     Value
130  All Luas lines  2018      1   3218649
131  All Luas lines  2018      2   3118289
132  All Luas lines  2018      3   3097570
133  All Luas lines  2018      4   3350056
134  All Luas lines  2018      5   3622338
..              ...   ...    ...       ...
190  All Luas lines  2022      9   3811093
191  All Luas lines  2022     10   4219124
192  All Luas lines  2022     11   4375705
193  All Luas lines  2022     12   4030698
194  All Luas lines  2022      0  38667875

[65 rows x 4 columns]

In [15]:
df= pd.DataFrame(df)

df = df.drop(df[df['Statistic_Label'] == 'All Luas lines'].index)

print(df)

    Statistic_Label  Year  Month     Value
0          Red line  2018      1   1664495
1          Red line  2018      2   1657562
2          Red line  2018      3   1661098
3          Red line  2018      4   1794424
4          Red line  2018      5   1934553
..              ...   ...    ...       ...
125      Green line  2022      9   1830015
126      Green line  2022     10   2063739
127      Green line  2022     11   2097731
128      Green line  2022     12   1972696
129      Green line  2022      0  18392801

[130 rows x 4 columns]

In [16]:
df.head(10)

  Statistic_Label  Year  Month    Value
0        Red line  2018      1  1664495
1        Red line  2018      2  1657562
2        Red line  2018      3  1661098
3        Red line  2018      4  1794424
4        Red line  2018      5  1934553
5        Red line  2018      6  1822500
6        Red line  2018      7  1841184
7        Red line  2018      8  1730239
8        Red line  2018      9  1810919
9        Red line  2018     10  2018390

# Dataset

df = red line & green line

df_1 = All Luas line

In [17]:
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import LabelEncoder

In [18]:
l_encoder = LabelEncoder()

# Put the type of all data of object type into the same shape (float).with the Encoder function.

In [19]:
df["Statistic_Label_Encoded"] =l_encoder.fit_transform(df["Statistic_Label"])

#To convert the numeric value of the 'Sex' column .l_encoder.fit_transform function

In [20]:
df_1["Statistic_Label_Encoded"] =l_encoder.fit_transform(df_1["Statistic_Label"])

In [21]:
df.head(2)

  Statistic_Label  Year  Month    Value  Statistic_Label_Encoded
0        Red line  2018      1  1664495                        1
1        Red line  2018      2  1657562                        1

Green Line = 1
Red Line=2

In [22]:
df_1.head(2)

    Statistic_Label  Year  Month    Value  Statistic_Label_Encoded
130  All Luas lines  2018      1  3218649                        0
131  All Luas lines  2018      2  3118289                        0

All Luas Lines = 0

In [23]:
df.drop(columns=["Statistic_Label"], inplace=True)

In [24]:
df_1.drop(columns=["Statistic_Label"], inplace=True)

In [25]:
df.head(2)

   Year  Month    Value  Statistic_Label_Encoded
0  2018      1  1664495                        1
1  2018      2  1657562                        1

In [26]:
df_1.head(2)

     Year  Month    Value  Statistic_Label_Encoded
130  2018      1  3218649                        0
131  2018      2  3118289                        0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Year                     130 non-null    int64
 1   Month                    130 non-null    int32
 2   Value                    130 non-null    int64
 3   Statistic_Label_Encoded  130 non-null    int32
dtypes: int32(2), int64(2)
memory usage: 3.2 KB

In [28]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65 entries, 130 to 194
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Year                     65 non-null     int64
 1   Month                    65 non-null     int32
 2   Value                    65 non-null     int64
 3   Statistic_Label_Encoded  65 non-null     int32
dtypes: int32(2), int64(2)
memory usage: 2.0 KB

In [29]:
df.shape

(130, 4)

In [30]:
df_1.shape

(65, 4)

In [31]:
missing_values = ['/',' ','-','--','na','Na','n/a','NA','n.a.','?','nan','Nan','nul','Nul','null','Null']

df1=pd.read_csv("Turkey_Rail_Passenger_Number.csv", encoding = 'latin-1' ,na_values=missing_values )

In [32]:
df1.isnull().sum()

passage_cnt              0
passanger_cnt            0
transaction_year         0
transaction_month        0
transaction_day          0
line                     0
station_name          3657
station_number        3657
town                 51100
age                      0
longitude            85345
latitude             85345
dtype: int64

In [33]:
df1.columns

Index(['passage_cnt', 'passanger_cnt', 'transaction_year', 'transaction_month',
       'transaction_day', 'line', 'station_name', 'station_number', 'town',
       'age', 'longitude', 'latitude'],
      dtype='object')

In [34]:
df1.head(5)

,passage_cnt,passanger_cnt,transaction_year,transaction_month,transaction_day,line,station_name,station_number,town,age,longitude,latitude
0,1687,1656,2022,1,1,F1-TAKSIM-KABATAS FUNIKILER HATTI,TAKSIM,TAK-KBT,Beyoðlu,20-30,28.986444,41.036750
1,2520,2469,2022,1,1,F1-TAKSIM-KABATAS FUNIKILER HATTI,KABATAS,KTS-TKS,Beyoðlu,20-30,28.992028,41.034056
2,2157,2119,2022,1,1,F1-TAKSIM-KABATAS FUNIKILER HATTI,TAKSIM,TAK-KBT,Beyoðlu,30-60,28.986444,41.036750
3,3163,3085,2022,1,1,F1-TAKSIM-KABATAS FUNIKILER HATTI,KABATAS,KTS-TKS,Beyoðlu,30-60,28.992028,41.034056
4,1041,1006,2022,1,1,F1-TAKSIM-KABATAS FUNIKILER HATTI,KABATAS,KTS-TKS,Beyoðlu,60+,28.992028,41.034056

In [35]:
df1.drop(columns=["station_name", "station_number", "town", "longitude", "latitude", "line"], inplace=True)

In [36]:
df1.head(2)

,passage_cnt,passanger_cnt,transaction_year,transaction_month,transaction_day,age
0,1687,1656,2022,1,1,20-30
1,2520,2469,2022,1,1,20-30

In [37]:
df1.isnull().sum() / len(df) * 100

passage_cnt          0.0
passanger_cnt        0.0
transaction_year     0.0
transaction_month    0.0
transaction_day      0.0
age                  0.0
dtype: float64

In [38]:
df1["age_Encoded"] =l_encoder.fit_transform(df1["age"])

In [39]:
df1.head(2)

,passage_cnt,passanger_cnt,transaction_year,transaction_month,transaction_day,age,age_Encoded
0,1687,1656,2022,1,1,20-30,0
1,2520,2469,2022,1,1,20-30,0

In [40]:
df1.drop(columns=["age"], inplace=True)

In [41]:
df1.head(2)

,passage_cnt,passanger_cnt,transaction_year,transaction_month,transaction_day,age_Encoded
0,1687,1656,2022,1,1,0
1,2520,2469,2022,1,1,0